app/controllers/events_controller.rb

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("updated_at", "description", "created_at") VALUES('2009-09-29 19:23:49', 'на рынке появится новый конкурент', '2009-09-29 19:23:49')

  def showrisklist
    @event = Event.find(params[:id])
    @goals = Goal.all
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
SELECT * FROM "goals"