app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "updated_at", "title", "content", "created_at") VALUES('Denis', '2009-09-26 19:03:02', 'First Post', 'This is my first post for ruby on rails app produced by NetBeans IDE.', '2009-09-26 19:03:02')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = 'This is my first post for ruby on rails app produced by NetBeans IDE!', "updated_at" = '2009-09-26 19:27:31' WHERE "id" = 1
---
  def update
  # @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
    def find_post
      @post = Post.find(params[:id])