app/controllers/risks_controller.rb

SELECT * FROM "risks"
---
  def index
    @risks = Risk.all

SELECT * FROM "risks" WHERE ("risks"."id" = 1)
---
  def show
    @risk = Risk.find(params[:id])

SELECT * FROM "events"
SELECT * FROM "goals"
---
  def new
    @risk = Risk.new
    @events = Event.all
    @goals = Goal.all

SELECT * FROM "risks" WHERE ("risks"."id" = 3)
---
  def edit
    @risk = Risk.find(params[:id])

SELECT * FROM "events" WHERE ("events"."id" = 1)
SELECT * FROM "goals" WHERE ("goals"."id" = 1)
INSERT INTO "risks" ("event_id", "updated_at", "description", "goal_id", "created_at") VALUES(1, '2009-10-08 22:03:21', NULL, 1, '2009-10-08 22:03:21')
UPDATE "risks" SET "description" = 'В результате того, что на рынке появится новый конкурент, уровень продаже не достигнет 1000 (+/- 1)', "updated_at" = '2009-10-07 20:18:01' WHERE "id" = 5
---
  def create
#    @event = Event.find(params[:event_id])
#    @goal = Goal.find(params[:goal_id])
    @risk = Risk.new(params[:risk])
    @event = Event.find(@risk.event)
    @goal = Goal.find(@risk.goal)
    @risk.description = "В результате того, что " + @event.description + ", " + @goal.description + " не " + @goal.action + " " + @goal.target + " (+/- " + @goal.deviation + ")"

    respond_to do |format|
      if @risk.save

SELECT * FROM "risks" WHERE ("risks"."id" = 3)
UPDATE "risks" SET "description" = 'В результате того, что на рынке появится новый конкурент, доля рынка не достигнет 30% (+/- 5%)', "updated_at" = '2009-10-18 19:24:39' WHERE "id" = 3
---
  def update
    @risk = Risk.find(params[:id])

    respond_to do |format|
      if @risk.update_attributes(params[:risk])

SELECT * FROM "risks" WHERE ("risks"."id" = 1)
DELETE FROM "risks" WHERE "id" = 1
---
  def destroy
    @risk = Risk.find(params[:id])
    @risk.destroy